{
  "encounter.pirate_ambush.intro": "A pirate vessel emerges from the asteroid field, weapons hot. \"Heave to and prepare to be boarded,\" crackles over the comm, \"or we'll blast you to atoms!\"",
  "encounter.pirate_ambush.fight": "Power up weapons and fight back",
  "encounter.pirate_ambush.flee": "Try to outrun them",
  "encounter.pirate_ambush.surrender": "Surrender and pay them off (${amount} credits)",
  "encounter.pirate_ambush.negotiate": "Try to talk your way out",
  "encounter.pirate_ambush.combat_result": "The battle is fierce but brief. Your weapons tear through the pirate's hull, and they break off the attack. You salvage what you can from the wreckage.",
  "encounter.pirate_ambush.escaped": "Your pilot pushes the engines to their limit. The pirate vessel falls behind, unable to match your speed. You're clear.",
  "encounter.pirate_ambush.caught": "The pirates match your every move. A lucky shot clips your engines, and you're forced to surrender what cargo you have.",
  "encounter.pirate_ambush.surrendered": "The pirates take their cut and leave you drifting. It stings, but at least you're alive.",
  "encounter.pirate_ambush.talked_down": "Your silver tongue works its magic. The pirate captain laughs and waves you through. \"You've got guts, spacer. Get out of here before I change my mind.\"",

  "encounter.patrol_inspection.intro": "A {faction_name} patrol vessel hails you. \"Unidentified ship, cut your engines and prepare for routine inspection.\"",
  "encounter.patrol_inspection.comply": "Comply with the inspection",
  "encounter.patrol_inspection.bribe": "Offer a 'processing fee' to skip the inspection",
  "encounter.patrol_inspection.flee": "Make a run for it",
  "encounter.patrol_inspection.inspection": "The patrol officers board your ship and conduct a thorough search. They check your cargo manifest, scan for contraband, and verify your credentials.",
  "encounter.patrol_inspection.cleared": "\"Everything checks out. You're free to go.\" The patrol vessel peels away and resumes its route.",
  "encounter.patrol_inspection.bribed": "The officer pockets the credits with a knowing nod. \"Everything looks in order here. Safe travels.\"",
  "encounter.patrol_inspection.bribe_failed": "The officer's face hardens. \"Are you trying to bribe a {faction_name} officer?\" They call for backup and conduct an even more thorough inspection, plus a fine for attempted bribery.",
  "encounter.patrol_inspection.fled": "Your ship's engines roar as you punch it. The patrol vessel gives chase but you lose them in the asteroid field. That was close.",
  "encounter.patrol_inspection.caught_fleeing": "The patrol vessel is faster than it looks. They disable your engines and board with weapons drawn. The fine for fleeing is steep.",

  "encounter.distress_signal.intro": "Your sensors pick up a distress signal from a nearby vessel. The message is garbled, but you can make out: \"...engine failure...life support failing...please help...\"",
  "encounter.distress_signal.investigate": "Move in to investigate",
  "encounter.distress_signal.scan": "Scan the area first",
  "encounter.distress_signal.ignore": "Ignore the signal and continue on your way",
  "encounter.distress_signal.scan_result": "Your sensors reveal the truth: the distress signal is genuine. A small transport is adrift with failing systems. No signs of an ambush.",
  "encounter.distress_signal.help": "Move in to help",
  "encounter.distress_signal.leave": "Leave them to their fate",
  "encounter.distress_signal.approach": "As you approach the source of the signal, something feels off. The disabled ship looks too conveniently placed...",
  "encounter.distress_signal.proceed": "Proceed carefully",
  "encounter.distress_signal.retreat": "This feels wrong - back off",
  "encounter.distress_signal.genuine_rescue": "The distress call was genuine. You help repair their ship and they reward you generously. \"You saved our lives. We won't forget this.\"",
  "encounter.distress_signal.ambushed": "It was a trap! Pirates emerge from hiding and open fire. You take damage before managing to escape.",
  "encounter.distress_signal.avoided_trap": "Your caution pays off. As you pull away, you see pirates emerge from hiding. They curse over the open channel as you escape.",
  "encounter.distress_signal.ignored": "You continue on your way. The distress signal fades into static behind you.",

  "encounter.trader.intro": "A merchant vessel hails you. \"{ship_name} here. We've got supplies to trade if you're interested. Fair prices, no questions asked.\"",
  "encounter.trader.buy_fuel": "Buy fuel (50 credits for 20 fuel)",
  "encounter.trader.buy_supplies": "Buy supplies (30 credits for meds and parts)",
  "encounter.trader.haggle": "Try to negotiate a better deal",
  "encounter.trader.decline": "No thanks, continue on your way",
  "encounter.trader.traded": "The trade is completed smoothly. The merchant waves as they depart. \"Pleasure doing business with you!\"",
  "encounter.trader.good_deal": "The merchant grins. \"Alright, alright, you drive a hard bargain. I can do a discount on fuel.\"",
  "encounter.trader.buy_fuel_discount": "Buy discounted fuel (35 credits for 20 fuel)",
  "encounter.trader.offended": "The merchant's expression sours. \"I don't have time for this. Good day.\" They cut the connection.",
  "encounter.trader.declined": "\"Your loss, friend. Safe travels.\" The merchant vessel moves on.",

  "encounter.smuggler.intro": "A nondescript freighter matches your course. A gruff voice comes over a private channel: \"Hey, spacer. I've got a proposition for you. Easy money, no questions. Interested?\"",
  "encounter.smuggler.accept": "Accept the job",
  "encounter.smuggler.decline": "Decline politely",
  "encounter.smuggler.report": "Threaten to report them",
  "encounter.smuggler.accepted": "\"Smart choice.\" The smuggler transfers the credits. \"Just forget you ever saw me.\" The freighter peels away and vanishes into the void.",
  "encounter.smuggler.declined": "\"Suit yourself.\" The channel goes dead and the freighter changes course, disappearing into the black.",
  "encounter.smuggler.intimidated": "The smuggler's eyes widen. \"Okay, okay! Here, take this and forget we ever met!\" They transfer some credits and flee.",
  "encounter.smuggler.hostile": "\"Big mistake, friend.\" The smuggler's ship opens fire before fleeing. You take some damage before they disappear.",

  "encounter.derelict.intro": "Your sensors detect a derelict vessel drifting nearby. It appears abandoned, but there might be salvage worth claiming.",
  "encounter.derelict.board": "Board the derelict",
  "encounter.derelict.scan": "Scan for hazards first",
  "encounter.derelict.ignore": "Leave it alone",
  "encounter.derelict.scan_complete": "Scans reveal the ship is safe to board. Life support is offline but the hull is intact. Sensors detect valuable salvage in the cargo hold.",
  "encounter.derelict.safe_board": "Board and salvage",
  "encounter.derelict.leave": "Leave it alone",
  "encounter.derelict.boarding": "You dock with the derelict and begin exploring. The ship is dark and silent, but your lights reveal...",
  "encounter.derelict.good_salvage": "...a cargo hold full of valuable goods! The previous crew must have abandoned ship in a hurry.",
  "encounter.derelict.hazard": "...a ruptured fuel line! You grab what you can before the situation becomes dangerous.",
  "encounter.derelict.safe_salvage": "The salvage operation goes smoothly. You recover valuable cargo and spare parts, plus some interesting data from the ship's computers.",
  "encounter.derelict.salvaged": "You secure the salvage and return to your ship. Not a bad haul.",
  "encounter.derelict.accident": "A minor accident during salvage operations. You got some goods, but it could have gone better.",
  "encounter.derelict.ignored": "You leave the derelict behind. Someone else's problem now.",

  "encounter.faction_agent.intro": "A sleek vessel intercepts your course. The pilot identifies themselves as an agent of {faction_name}. \"I have a business proposition for you, Captain.\"",
  "encounter.faction_agent.listen": "Hear them out",
  "encounter.faction_agent.refuse": "Refuse to engage",
  "encounter.faction_agent.proposal": "\"We need someone to deliver a package. No questions about contents, no records. Standard courier rates, plus a bonus for discretion.\"",
  "encounter.faction_agent.accept": "Accept the job",
  "encounter.faction_agent.negotiate": "Try to negotiate better terms",
  "encounter.faction_agent.decline": "Decline the offer",
  "encounter.faction_agent.accepted": "\"Excellent. The package will be delivered to your hold. You'll receive the rest of the payment on delivery.\" The agent's ship peels away.",
  "encounter.faction_agent.declined": "\"A pity. Perhaps another time.\" The agent's ship changes course and disappears.",
  "encounter.faction_agent.refused": "You cut the channel without responding. The agent's ship lingers for a moment, then moves on.",

  "encounter.mysterious_signal.intro": "Your sensors detect an unusual signal emanating from a nearby asteroid. It doesn't match any known frequency patterns.",
  "encounter.mysterious_signal.investigate": "Investigate the source",
  "encounter.mysterious_signal.analyze": "Try to decode the signal",
  "encounter.mysterious_signal.ignore": "Ignore it and continue on",
  "encounter.mysterious_signal.investigation": "You approach the asteroid and find a hidden cache. Someone went to great lengths to conceal this...",
  "encounter.mysterious_signal.discovery": "Search the cache thoroughly",
  "encounter.mysterious_signal.nothing": "It's just old equipment - not worth the time",
  "encounter.mysterious_signal.decoded": "Your tech expert cracks the signal. It's coordinates to a hidden cache! You find valuable salvage and encrypted data worth a fortune.",
  "encounter.mysterious_signal.found_something": "The cache contains valuable equipment and credits. Whoever hid this isn't coming back for it.",
  "encounter.mysterious_signal.dead_end": "After hours of searching, you find nothing of value. Time wasted.",
  "encounter.mysterious_signal.ignored": "You log the signal's location and continue on your way. Maybe another time.",

  "encounter.mechanical_failure.intro": "Warning klaxons blare as your ship shudders. A critical system has failed and needs immediate attention.",
  "encounter.mechanical_failure.repair": "Attempt a proper repair",
  "encounter.mechanical_failure.jury_rig": "Jury-rig a temporary fix",
  "encounter.mechanical_failure.use_parts": "Use spare parts for a guaranteed fix",
  "encounter.mechanical_failure.repaired": "Your engineer works their magic. The system is back online and running better than before.",
  "encounter.mechanical_failure.partial_repair": "The repair doesn't quite hold. You'll need proper maintenance at a station, and the delay costs you time.",
  "encounter.mechanical_failure.jury_rigged": "The temporary fix holds, but it's not pretty. The ship will need proper repairs at the next station.",
  "encounter.mechanical_failure.fixed_with_parts": "The spare parts do the trick. The system is back to full functionality.",

  "encounter.refugee_plea.intro": "A small, battered vessel hails you. \"Please, we need help. We're refugees fleeing the conflict. Our supplies are nearly gone.\"",
  "encounter.refugee_plea.help": "Give them supplies",
  "encounter.refugee_plea.offer_passage": "Offer them passage to the next station",
  "encounter.refugee_plea.decline": "Decline and continue on",
  "encounter.refugee_plea.investigate": "Ask more questions first",
  "encounter.refugee_plea.helped": "The refugees are grateful beyond words. \"Thank you, Captain. You've given us hope.\" They share what little information they have about the sector.",
  "encounter.refugee_plea.passengers": "The refugees board your ship. They're quiet and stay out of the way. At the next station, they pay you what they can and disappear into the crowd.",
  "encounter.refugee_plea.declined": "The refugees' faces fall as you break off contact. You continue on your way.",
  "encounter.refugee_plea.truth_revealed": "Your questions reveal they're not quite what they seem - they're actually deserters from a mercenary company, fleeing with stolen data.",
  "encounter.refugee_plea.still_help": "Help them anyway",
  "encounter.refugee_plea.leave": "Leave them to their fate",

  "encounter.test.intro": "This is a test encounter for development purposes.",
  "encounter.test.option_a": "Choose option A",
  "encounter.test.option_b": "Choose option B (requires skill check)",
  "encounter.test.result_a": "You chose option A. The encounter ends.",
  "encounter.test.result_b_success": "Your skill check succeeded! Great job.",
  "encounter.test.result_b_failure": "Your skill check failed. Better luck next time."
}
